In [1]:
import pandas as pd

In [7]:
data_set = {
    'name': ['John', 'Jane','Joe', 'Jack', 'Jill'],
    'marks': [90, 80, 70, 60, 50],
}

df = pd.DataFrame(data_set)
df

   name  marks
0  John     90
1  Jane     80
2   Joe     70
3  Jack     60
4  Jill     50